{
  "header": "About Data",
  "headerInfo": "Data for the <about> page.",

  "mission": "As the Philippines' premier chapter of the internationally recognized organization, UP ACM is commited to provide high-quality Technology advancement opportunities to its members that can make them globally competitive and to establish the success of various Computing fields by offering services to our partners that can stipulate significant impact to the communities.",
  "vision": "Be a leader in delivering breakthrough innovations in the field of Computing and be an epitome in embracing a diverse and inclusive environment where communities are empowered by the possibilities found through Information Technology and Computer Science.",

  "coreValues": {
	  "header": "Core Values",
	  "headerInfo": "We are focused in developing and sharing technical knowledge and skills while monitoring the welfare of our stakeholders. The WE CARE values underlie our work as a family of technology enthusiasts, define the recommended interaction with each other, and provide the best strategies to fulfill our mission:",
	  "list": [
		  "Wellbeing of Members and Partners",
		  "Empowerment on Computing-driven innovation",
		  "Collaboration across teams and functions",
		  "Accountability to work and colleagues",
		  "Recognition of Diversity and Inclusion",
		  "Excellence in all we do"
	  ]
  },

  "historyIntro": [
    "The Association for Computing Machinery - University of the Philippines Student Chapter (UP ACM) is the first local student chapter of the largest scientific and educational international computing society, the Association for Computing Machinery, and remains as one of Manila’s premiere student organizations for computing. We support our members in the pursuit of academic excellence, leading to a regular batch of honor graduates from the organization every year.",

    "UP ACM connects people and ideas by delivering quality lectures, workshops, and competitions with schools and universities across Metro Manila. With annual projects for each academic level - from elementary to graduate level - UP ACM leads the way in forwarding computer science and technology in the pursuit of our common goal: to develop the communities of our future."
  ],
  "history": [
    {
      "date": "2003",
      "event": "The Association for Computing Machinery - UP Diliman Student Chapter Inc. (UP ACM) was founded in the Academic Year of 2003. It was initially established by graduate students focused on academics and research. It was formally founded in 2003 and undergraduates were invited to join the organization."
    },
    {
      "date": "2013",
      "event": "Easy as Py, a series of lectures that will provide high schools without programming backgrounds the basic knowledge needed to be able to create and run computer programs using the Python programming language, was formally launched."
    },
    {
      "date": "2014",
      "event": "Algolympics, a series of lectures that will provide high schools without programming backgrounds the basic knowledge needed to be able to create and run computer programs using the Python programming language, was formally launched as an inter-collegiate event."
    },
    {
      "date": "2014",
      "event": "SCRATCH Code Camps, a series of lectures that will provide high schools without programming backgrounds the basic knowledge needed to be able to create and run computer programs using the Scratch, a block-based visual programming language, was formally launched."
    },
    {
      "date": "2014",
      "event": "Automaton, the official publication of UP ACM, was formally launched. Today, it has been rebranded as a regular social media post containing bits of information about the latest developments in computer science."
    },
    {
      "date": "2015",
      "event": "Gamecraft, a series of events dedicated to learning more about game development, was formally launched."
    },
    {
      "date": "2015",
      "event": "Haxxor was formally launched as a lecture series about computer security. In the following year, it added a “capture-the-flag” competition component."
    },
    {
      "date": "2020",
      "event": "Jumpstart and Hodgepodge, a lecture series where representatives from companies give their professional advice and expertise on the applications of Computer Science (CS) and Information and Communications Technology (ICT) in the workplace and industry, was launched."
    },
    {
      "date": "2021",
      "event": "ACMastery, a workshop series where members can explore new topics adjacent to Computer Science fields. This includes Bioinformatics, which discusses the tools and theories involved in variant calling and genome assembly; And Cybersecurity, through an introduction to web application vulnerabilities and general security, which culminates into a mini-Capture the Flag event."
    }
  ],

  "achievementsIntro": "Throughout the years, UP ACM has cultivated a culture of excellence in our projects and events that are geared towards achieving our mission and vision as a computing organization. We are remarkeable at creating these avenues for people to learn more about computing beyond the classroom setting.",
  "achievements": [
    {
      "name": "ACM Chapter Excellence Award",
      "event": "Recruitment Program",
      "date": "2005",
      "scope": "international"
    },
    {
      "name": "ACM Chapter Excellence Award",
      "event": "Community Service",
      "date": "2005",
      "scope": "international"
    },
    {
      "name": "ACM Chapter Excellence Award",
      "event": "Community Service",
      "scope": "international",
      "date": "2006"
    },
    {
      "name": "Engineering Organization Excellence Awards",
      "event": "Excellence in Academics Award",
      "date": "2018",
      "scope": "local"
    }
  ]
}
